{"format": "graph-model", "generatedBy": "2.9.2", "convertedBy": "TensorFlow.js Converter v4.1.0", "signature": {"inputs": {"input_0": {"name": "input_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "27"}]}}}, "outputs": {"LAYER_4": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "27"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "27"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "27"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_0/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/LAYER_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "27"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "27"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/Shape", "op": "Shape", "input": ["input_0"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/LAYER_0/Tensordot/Shape", "StatefulPartitionedCall/model/LAYER_0/Tensordot/axes", "StatefulPartitionedCall/model/LAYER_0/Tensordot/GatherV2_1/axis"], "attr": {"batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/LAYER_0/Tensordot/Shape", "StatefulPartitionedCall/model/LAYER_0/Tensordot/free", "StatefulPartitionedCall/model/LAYER_0/Tensordot/GatherV2/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/model/LAYER_0/Tensordot/GatherV2_1", "StatefulPartitionedCall/model/LAYER_0/Tensordot/Const_1"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/model/LAYER_0/Tensordot/GatherV2", "StatefulPartitionedCall/model/LAYER_0/Tensordot/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model/LAYER_0/Tensordot/GatherV2", "StatefulPartitionedCall/model/LAYER_0/Tensordot/Const_2", "StatefulPartitionedCall/model/LAYER_0/Tensordot/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model/LAYER_0/Tensordot/Prod", "StatefulPartitionedCall/model/LAYER_0/Tensordot/Prod_1"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/Reshape", "op": "Reshape", "input": ["input_0", "StatefulPartitionedCall/model/LAYER_0/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model/LAYER_0/Tensordot/Reshape", "StatefulPartitionedCall/model/LAYER_0/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/model/LAYER_0/Tensordot/MatMul", "StatefulPartitionedCall/model/LAYER_0/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_0/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/LAYER_0/Tensordot", "StatefulPartitionedCall/model/LAYER_0/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model/LAYER_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/LAYER_0/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/LAYER_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/LAYER_2/Tensordot/Shape", "StatefulPartitionedCall/model/LAYER_2/Tensordot/axes", "StatefulPartitionedCall/model/LAYER_2/Tensordot/GatherV2_1/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/LAYER_2/Tensordot/Shape", "StatefulPartitionedCall/model/LAYER_2/Tensordot/free", "StatefulPartitionedCall/model/LAYER_2/Tensordot/GatherV2/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/model/LAYER_2/Tensordot/GatherV2_1", "StatefulPartitionedCall/model/LAYER_2/Tensordot/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/model/LAYER_2/Tensordot/GatherV2", "StatefulPartitionedCall/model/LAYER_2/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model/LAYER_2/Tensordot/GatherV2", "StatefulPartitionedCall/model/LAYER_2/Tensordot/Const_2", "StatefulPartitionedCall/model/LAYER_2/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model/LAYER_2/Tensordot/Prod", "StatefulPartitionedCall/model/LAYER_2/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model/LAYER_1/Relu", "StatefulPartitionedCall/model/LAYER_2/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model/LAYER_2/Tensordot/Reshape", "StatefulPartitionedCall/model/LAYER_2/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/model/LAYER_2/Tensordot/MatMul", "StatefulPartitionedCall/model/LAYER_2/Tensordot/concat_1"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/LAYER_2/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/LAYER_2/Tensordot", "StatefulPartitionedCall/model/LAYER_2/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model/LAYER_3/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/LAYER_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/LAYER_3/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/LAYER_4/Tensordot/Shape", "StatefulPartitionedCall/model/LAYER_4/Tensordot/axes", "StatefulPartitionedCall/model/LAYER_4/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/LAYER_4/Tensordot/Shape", "StatefulPartitionedCall/model/LAYER_4/Tensordot/free", "StatefulPartitionedCall/model/LAYER_4/Tensordot/GatherV2/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/model/LAYER_4/Tensordot/GatherV2_1", "StatefulPartitionedCall/model/LAYER_4/Tensordot/Const_1"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/model/LAYER_4/Tensordot/GatherV2", "StatefulPartitionedCall/model/LAYER_4/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model/LAYER_4/Tensordot/GatherV2", "StatefulPartitionedCall/model/LAYER_4/Tensordot/Const_2", "StatefulPartitionedCall/model/LAYER_4/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model/LAYER_4/Tensordot/Prod", "StatefulPartitionedCall/model/LAYER_4/Tensordot/Prod_1"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model/LAYER_3/Relu", "StatefulPartitionedCall/model/LAYER_4/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model/LAYER_4/Tensordot/Reshape", "StatefulPartitionedCall/model/LAYER_4/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/model/LAYER_4/Tensordot/MatMul", "StatefulPartitionedCall/model/LAYER_4/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/LAYER_4/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/LAYER_4/Tensordot", "StatefulPartitionedCall/model/LAYER_4/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model/LAYER_4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1286}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/ReadVariableOp", "shape": [32, 27], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/ReadVariableOp", "shape": [16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/ReadVariableOp", "shape": [27, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/LAYER_0/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/LAYER_0/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/LAYER_2/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/LAYER_2/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/LAYER_4/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/LAYER_4/BiasAdd/ReadVariableOp", "shape": [27], "dtype": "float32"}]}]}